# Задача 26:  
# Напишите программу, которая на вход принимает два числа A и B, и возводит число А в целую степень B с помощью рекурсии.

# def exponentiation(num, degree):
#     if (degree == 1):
#         return num
#     if (degree != 1):
#         return (num * exponentiation(num, degree - 1))
# num = int(input("Введите число: "))
# degree = int(input("Введите его степень: "))
# print("Результат возведения в степень равен:", exponentiation(num, degree))