# Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.


# num_1 = int(input("Введите первое число: "))
# num_2 = int(input("Введите второе число: ")) 
# def sum(num_1, num_2):
#     if num_2 == 0:
#          return num_1
#     elif num_1 == 0:
#         return num_2 
#     elif num_1 < 0 or num_2 < 0:
#         return print("Вы ввели отрицательное число")  
#     return sum(num_1+1, num_2-1)     
# print(sum(num_1, num_2))
